## Crear un subconjunto de datos

#### Subconjunto de columna o columnas

In [1]:
import pandas as pd
#data=dataframe

In [ ]:
#Extraer varias columnas de un dataset en un subset
subset = data[["Col1", "Col2", "Col3", "Col4"]]

type(subset) 
#si cogemos una sola columna: objeto tipo series, no usar funciones de dataframe
#si cogemos varias columnas: objeto tipo dataframe

In [ ]:
##Columnas como variable
desired_columns = ["Col1", "Col2", "Col3", "Col4"]
subset = data[desired_columns]
subset.head()

In [ ]:
#Cuando hay muchas columnas, uso de bucles para crear lista:

all_columns_list = data.columns.values.tolist()
desired_columns = ["Col1", "Col2", "Col3", "Col4"]

sublist = [x for x in all_columns_list if x not in desired_columns]

sublist
subset = data[sublist]
subset.head()

##Alternativo

    a = set(desired_columns)
    b = set(all_columns_list)
    sublist = b-a
    sublist = list(sublist)

#### Subconjunto de filas

In [ ]:
data[0:25]
data[10:35]
data[:8] # CORRECCIÓN: es lo mismo que data[0:8]
data[60:] #del 60 en adelante

#### Subconjuntos de filas con condiciones booleanas

In [2]:
##filtrar filas por valor de columna, condición booleana

data1 = data[data["colum"]>x] 
data1.shape

data2 = data[data["colum"]=="NY"]
data2.shape

data3 = data[(data["colum"]>300) & (data["colum2"]=="NY")] #and
data3.shape

data4 = data[(data["colum"]>300) | (data["colum2"]=="NY")] #or
data4.shape

data5 = data[data["colum"]<data["colum2"]]
data5.shape

NameError: name 'data' is not defined

### Filtrado con ix -> loc e iloc

In [ ]:
#Un filtro por corchete, el primer corchete filtrado de columnas y el segundo corchete filtro sobre fila
subset_first_50 = data[["colum", "colum2", "colum3"]][:50]
subset_first_50.head()

In [ ]:
#ix: poner en un mismo corchete filas y columnas // como en R -- OBSOLETO
data.ix[:10, 3:6] ## Primeras 10 filas, columnas de la 3 a la 6

#.loc para etiquetas y .iloc para posiciones
data.loc[[1,5,8,36], ["Area Code", "VMail Plan", "Day Mins"]]

data.iloc[:10, 3:6]
data.iloc[:,3:6] ##Todas las filas para las columnas entre la 3 y la 6
data.iloc[:10,:] ##Todas las columnas para las filas de la 1 a la 10
data.iloc[1:10, [2,5,7]]
data.iloc[[1,5,8,36], [2,5,7]]

#### Insertar nuevas filas en el dataframe

In [ ]:
data["new_col"] = data["col1"] + data["col2"] + data["col3"]
##crear una columna es únicamente llamarla dentro del DF e igualarla a algo

## Generación aleatoria de números

In [3]:
import numpy as np

In [ ]:
##simulación de modelos probabilísticos multicasos. análisis predictivo

np.random.randint(1,100) #número entero aleatorio del 1 al 100

np.random.random() #aleatorio entre 0 y 1

In [ ]:
##Función que genera una lista de n números aleatorios enteros dentro del intervalo [a,b]
def randint_list(n, a, b):
    x = []
    for i in range(n): #range: array desde 0 hasta n
        x.append(np.random.randint(a,b))
    return x

In [ ]:
import random #leer libreria
random.randrange(0,100,7) #de 0 a 100 múltiplos de 7

#### Shuffling

In [12]:
#Creo un vector del 0 al 99
a=np.arange(100)
#Mezclo los valores / desordenar
np.random.shuffle(a)
a

array([38, 87, 92,  0, 74, 98, 94, 61, 91, 70, 86, 27, 30, 62, 60, 97, 33,
       49,  7, 51, 24, 43, 67, 28, 63, 21, 81, 77, 64, 42, 89, 18, 11, 19,
        2, 10, 78, 45, 41, 32, 80,  6, 23, 68, 82, 31,  1, 75, 40, 20, 50,
       65, 66, 57, 54, 26, 84, 13, 76, 72, 96, 71, 59, 29, 12, 35, 15, 56,
       79, 14,  9, 99, 93, 58, 16, 48, 55, 69, 36, 90, 47, 34,  8,  4, 83,
        3, 88, 44, 85, 25,  5, 37, 46, 73, 22, 17, 39, 52, 53, 95])

#### Choice

In [ ]:
#elegir un objeto al azar en una lsita
np.random.choice(column_list)

## Distribuciones

In [ ]:
data = np.random.uniform(a, b, n) #Uniforme
data = np.random.randn(n) #Normal estándar
plt.plot(x,sorted(data)) #Distr. gauss. acumulada

#Generación de distribución normal estándar
mu = 5.5
sd = 2.5
Z_n = np.random.randn(n)

#Particularizar a nuestro conjunto de datos con sd y media mu
data = mu + sd * Z_10000 # Z = (X - mu) / sd -> N(0,1), X = mu + sd * Z
plt.hist(data)

#Array de numeros aleatorios
data = np.random.randn(n,m) #n cols y m filas de números aleatorios

### Generación de dummy data frames

In [ ]:
##Para ejemplificar que nuestros modelos funcionan

n = 1000000
data = pd.DataFrame(
    {
        'A' : np.random.randn(n),
        'B' : 1.5 + 2.5 * np.random.randn(n),
        'C' : np.random.uniform(5, 32, n)
    }
)

data.describe()
plt.hist(data["A"])

# Agregación de datos por categoría

### Dummy DF con variables categóricas

In [18]:
import numpy as np
import pandas as pd

##Generamos categorías

gender = ["Male", "Female"]
income = ["Poor", "Middle Class", "Rich"]

n = 500

gender_data = []
income_data = []

#Muestreo aleatorio de n observaciones de nuestras categorías (dummies)

for i in range(0,n):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))
    
#Asignar características aleatorias a nuestros dummies
    
#Z -> N(0,1)
#N(m, s) -> m + s * Z
height = 160 + 30 * np.random.randn(n)
weight = 65 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.rand(n)

#Generación del dataframe

data = pd.DataFrame(
    {
        "Gender" : gender_data,
        "Economic Status" : income_data,
        "Height" : height,
        "Weight" : weight,
        "Age" : age,
        "Income" : income
    }
)

data.head()

   Gender Economic Status      Height     Weight        Age        Income
0  Female    Middle Class  180.984436  86.771126  50.228206  19825.179888
1    Male    Middle Class  149.626828  92.248513  37.512661  19223.092737
2    Male            Poor  119.623194  27.339284  40.810516  20375.173248
3  Female    Middle Class   83.403696  43.781061  11.200374  18564.975837
4  Female            Rich  172.290641  26.475937  14.562663  21270.755924

## Agrupación de datos

In [ ]:
#Objeto agrupado por índices
grouped_gender = data.groupby("Gender")
grouped_gender.groups

#Iterar sobre cada objeto, si se necesitan hacer operaciones para cada grupo
for names, groups in grouped_gender:
    print(names)
    print(groups)
    
#Obtener un grupo específico
grouped_gender.get_group("Female")

In [20]:
#Doble groupby

double_group = data.groupby(["Gender", "Economic Status"]) #6 grupos

for names, groups in double_group:
    print(names)
    print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height     Weight        Age        Income
0    Female    Middle Class  180.984436  86.771126  50.228206  19825.179888
3    Female    Middle Class   83.403696  43.781061  11.200374  18564.975837
10   Female    Middle Class  184.706785  85.028402  25.649439  19057.874664
16   Female    Middle Class  199.064142  91.921124  14.816280  21357.242861
19   Female    Middle Class  200.831010  92.753459  17.551703  21456.430919
..      ...             ...         ...        ...        ...           ...
459  Female    Middle Class  209.284402  66.578692  39.650434  20276.414298
469  Female    Middle Class  151.119331  72.458005  27.474612  18343.263665
473  Female    Middle Class  188.863430  20.943327  47.432284  20418.888665
489  Female    Middle Class  166.014420  83.261174   4.817838  19567.032536
498  Female    Middle Class  181.328025  59.823031  31.254002  19502.223344

[81 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status      Height     Weight        Age        Income
5    Female            Poor  199.489185  57.832391  34.626862  19653.899285
9    Female            Poor  158.014287  58.160714  10.587891  21058.345067
17   Female            Poor  149.002871  28.886248  43.260414  21210.299273
18   Female            Poor  127.968251  72.868543  38.504441  18947.225625
22   Female            Poor  136.873236  76.994844  21.230761  19896.939083
..      ...             ...         ...        ...        ...           ...
474  Female            Poor  184.485484  82.002045  25.895286  18848.746944
478  Female            Poor  141.864486  63.685268  10.732035  19971.897290
479  Female            Poor  121.278032  77.226936  44.707810  20061.420130
488  Female            Poor  175.416312  57.690155  21.320466  21149.368768
493  Female            Poor  204.604336  82.783647  40.863896  20489.089359

[90 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status      Height      Weight        Age        Income
4    Female            Rich  172.290641   26.475937  14.562663  21270.755924
8    Female            Rich  109.993786   79.148056  38.741772  20038.457850
15   Female            Rich  118.148613   86.552736  10.454148  19139.044774
34   Female            Rich  154.286017  118.729121  -8.470781  18261.988989
37   Female            Rich  165.301724   36.837167  40.804981  20964.302326
..      ...             ...         ...         ...        ...           ...
481  Female            Rich  109.217440   62.476592  26.260981  21087.819331
484  Female            Rich  119.026057   81.438197  51.351759  20717.847483
485  Female            Rich  181.290438   85.266164  27.409553  18256.730670
496  Female            Rich  128.917466   57.605341  19.007941  21222.437519
499  Female            Rich  152.804654   80.012656  22.701253  19135.407441

[89 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height     Weight        Age        Income
1     Male    Middle Class  149.626828  92.248513  37.512661  19223.092737
7     Male    Middle Class  203.577094  56.876997  22.176842  19702.480149
11    Male    Middle Class  134.211153  81.938595  58.713842  19970.141544
14    Male    Middle Class  136.536279  66.783818  21.214459  20214.901587
20    Male    Middle Class  172.500620  58.771283  33.982259  20171.381224
..     ...             ...         ...        ...        ...           ...
482   Male    Middle Class  172.857603  67.791614  20.633700  20823.206319
483   Male    Middle Class  200.212860  38.772235  39.496480  21024.917001
486   Male    Middle Class  159.439793  46.915483  -0.913527  20501.531679
490   Male    Middle Class  193.799418  46.559605  34.552984  18160.610885
494   Male    Middle Class  153.361160  81.279034  37.919718  20389.459786

[86 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height     Weight        Age        Income
2     Male            Poor  119.623194  27.339284  40.810516  20375.173248
6     Male            Poor  149.511763  56.854054  28.870848  18138.842975
25    Male            Poor  118.668439  78.725764  54.237908  18378.565152
43    Male            Poor  156.919388   5.039937  45.387597  18176.745920
44    Male            Poor  166.724362  63.132608  58.243471  20338.337484
..     ...             ...         ...        ...        ...           ...
471   Male            Poor  167.808926  58.744490  26.278374  19999.108359
480   Male            Poor  156.870897  27.943789  20.022326  20841.408259
487   Male            Poor  192.539798  71.784598  34.568925  18173.008489
491   Male            Poor  253.652400  39.766668  30.448469  18078.756115
495   Male            Poor  175.282364  64.239224  16.330200  18185.357205

[76 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height      Weight        Age        Income
12    Male            Rich  116.189249  112.149063  18.737234  18417.651126
13    Male            Rich  163.774493   95.659267  52.696574  20026.773953
23    Male            Rich  150.782138   52.677011  21.252269  21211.156833
28    Male            Rich  176.525956   61.694044  23.616114  18922.692090
39    Male            Rich  164.797609   52.614741  20.889205  19049.012978
..     ...             ...         ...         ...        ...           ...
465   Male            Rich  211.814516   29.215242  29.643978  20662.723214
466   Male            Rich  130.743739   40.004073  36.472012  20503.607526
468   Male            Rich  128.024280   52.812506  27.422565  19635.627291
492   Male            Rich  142.703593   69.245405  27.468551  19335.320487
497   Male            Rich  182.647281   38.437520  29.902987  21239.972729

[78 rows x 6 columns]

### Operaciones sobre datos agrupados

In [ ]:
#agregado de datos agrupados (aplicación de funciones)
double_group.sum()
double_group.mean()
double_group.size()
double_group.describe()

#Tratamiendo de DF usual, podemos acceder a una categoría para realizar las operaciones 
double_group["Income"]

### Agregado de funciones: método aggregate

In [21]:
#Aggregate aplica funciones por categorías y crea un nuevo DF
double_group.aggregate(
    {
        "Income": np.sum,
        "Age" : np.mean,
        "Height" : np.std
    }
)


double_group.aggregate(
    {
        "Age" : np.mean,
        "Height" : lambda h:(np.mean(h))/np.std(h) #Tipificación por una función lambda
    }
)

#Aplicar una o varias funciones a todas las columnas:
double_group.aggregate([np.sum, np.mean, np.std])
double_group.aggregate([lambda x: np.mean(x) / np.std(x)])

                              Income        Age     Height
Gender Economic Status
Female Middle Class     1.597759e+06  28.608246  29.391114
       Poor             1.777748e+06  31.708116  29.692444
       Rich             1.749472e+06  28.542767  30.899255
Male   Middle Class     1.692182e+06  29.356076  26.755674
       Poor             1.495972e+06  31.528095  33.931411
       Rich             1.556833e+06  29.942922  27.648578

## Filtrado y transformación de datos

In [ ]:
#Grupos cuya columna edad superen los 24000
double_group["Age"].filter(lambda x: x.sum()>2400) #FILTER funcion
#Devuelve los elementos del grupo completo que cumplan con el filtro

In [ ]:
import matplotlib.pyplot as plt
#transformación de un dataframe aplicando una función a todos sus elementos
zscore = lambda x : (x - x.mean())/x.std()
z_group = double_group.transform(zscore) #Transformación matemática a una columna numérica
plt.hist(z_group["Age"])

In [ ]:
#podemos usar transform para rellenar los NA con la media
fill_na_mean = lambda x : x.fillna(x.mean())
double_group.transform(fill_na_mean)

## Operaciones diversas muy útiles

In [22]:
double_group.head(1)
double_group.tail(1)
double_group.nth(32)

data_sorted = data.sort_values(["Age", "Income"])
data_sorted.head(10)

age_grouped = data_sorted.groupby("Gender")
age_grouped.head(1)

     Gender Economic Status      Height      Weight       Age        Income
34   Female            Rich  154.286017  118.729121 -8.470781  18261.988989
486    Male    Middle Class  159.439793   46.915483 -0.913527  20501.531679